RealxSCV/TomotachiLife-AutoDrawing/firmware/esp32/src/classic_bt_controller_transport.cpp
  const uint8_t defaultDummy[] = {0x00, 0x8E, 0x00, 0x00, 0x00, 0x00,
                                  0x08, 0x80, 0x00, 0x08, 0x80};
  std::memcpy(dummyReport_, defaultDummy, sizeof(dummyReport_));
  updateInputReport();
}

void ClassicBtControllerTransport::setButtonBits(uint32_t buttonsMask) {
  buttonsRight_ = 0;
  buttonsShared_ = 0;
  buttonsLeft_ = 0;

  if ((buttonsMask & controllerButtonMask(ControllerButton::Y)) != 0) {
    buttonsRight_ |= 1u << 0;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::X)) != 0) {
    buttonsRight_ |= 1u << 1;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::B)) != 0) {
    buttonsRight_ |= 1u << 2;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::A)) != 0) {
    buttonsRight_ |= 1u << 3;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::R)) != 0) {
    buttonsRight_ |= 1u << 6;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::ZR)) != 0) {
    buttonsRight_ |= 1u << 7;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::L)) != 0) {
    buttonsLeft_ |= 1u << 6;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::ZL)) != 0) {
    buttonsLeft_ |= 1u << 7;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::DpadDown)) != 0) {
    buttonsLeft_ |= 1u << 0;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::DpadUp)) != 0) {
    buttonsLeft_ |= 1u << 1;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::DpadRight)) != 0) {
    buttonsLeft_ |= 1u << 2;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::DpadLeft)) != 0) {
    buttonsLeft_ |= 1u << 3;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::Minus)) != 0) {
    buttonsShared_ |= 1u << 0;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::Plus)) != 0) {
    buttonsShared_ |= 1u << 1;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::RStick)) != 0) {
    buttonsShared_ |= 1u << 2;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::LStick)) != 0) {
    buttonsShared_ |= 1u << 3;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::Home)) != 0) {
    buttonsShared_ |= 1u << 4;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::Capture)) != 0) {
    buttonsShared_ |= 1u << 5;
  }
}

void ClassicBtControllerTransport::setLeftStickFromVector(int x, int y) {
  leftStickX_ = x < 0 ? kStickMin : (x > 0 ? kStickMax : kStickCenter);
  leftStickY_ = y < 0 ? kStickMax : (y > 0 ? kStickMin : kStickCenter);
  rightStickX_ = kStickCenter;
  rightStickY_ = kStickCenter;
}

void ClassicBtControllerTransport::updateInputReport() {
  report30_[0] = timer_;
  report30_[2] = buttonsRight_;
  report30_[3] = buttonsShared_;
  report30_[4] = buttonsLeft_;
  report30_[5] = static_cast<uint8_t>((leftStickX_ << 4) & 0xF0);
  report30_[6] = static_cast<uint8_t>((leftStickX_ & 0xF0) >> 4);
  report30_[7] = leftStickY_;
  report30_[8] = static_cast<uint8_t>((rightStickX_ << 4) & 0xF0);
  report30_[9] = static_cast<uint8_t>((rightStickX_ & 0xF0) >> 4);
  report30_[10] = rightStickY_;

  dummyReport_[0] = timer_;
}

void ClassicBtControllerTransport::ensureSendTask() {
  if (sendTaskHandle_ != nullptr) {
    return;
  }

  xTaskCreatePinnedToCore(
      &ClassicBtControllerTransport::sendTaskTrampoline,
      "switch_send_task",
      4096,
      this,
      2,
      &sendTaskHandle_,
      0);
}

void ClassicBtControllerTransport::sendTaskTrampoline(void *param) {
  auto *transport = static_cast<ClassicBtControllerTransport *>(param);
  while (true) {
    transport->sendCurrentInputReport(false);
    vTaskDelay(pdMS_TO_TICKS((transport->connected_ || transport->paired_) ? 15 : 100));
  }
}

void ClassicBtControllerTransport::pressButtons(
    uint32_t buttonsMask, uint16_t holdMs, uint16_t settleMs) {
  setButtonBits(buttonsMask);
  updateInputReport();
  sendCurrentInputReport(true);
  delay(holdMs);
  clearInputs();
  sendCurrentInputReport(true);
  delay(settleMs);
}

void ClassicBtControllerTransport::moveDirection(
    int x, int y, uint16_t holdMs, uint16_t settleMs) {
  buttonsRight_ = 0;
  buttonsShared_ = 0;
  buttonsLeft_ = 0;
  setLeftStickFromVector(x, y);
  updateInputReport();
  sendCurrentInputReport(true);
  delay(holdMs);
  clearInputs();
  sendCurrentInputReport(true);
  delay(settleMs);
}

bool ClassicBtControllerTransport::resetConnection() {
  const esp_err_t err = esp_bt_hid_device_virtual_cable_unplug();
  if (err != ESP_OK) {
    Serial.printf("WARN bt reset failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  connected_ = false;
  authComplete_ = false;
  pairingComplete_ = false;
  paired_ = false;
  readyForReports_ = false;
  discoverable_ = true;
  esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
  Serial.println("INFO bt reset requested mode=virtual-cable-unplug");
  return true;
}

void ClassicBtControllerTransport::printStatus(Print &output) const {
  output.println("INFO bt_mode=classic-bt-hid");
  output.println("INFO bt_profile=uartswitchcon-pro-controller");
  output.print("INFO bt_stack_started=");
  output.println(boolName(stackStarted_));
  output.print("INFO bt_bluedroid_ready=");
  output.println(boolName(bluedroidReady_));
  output.print("INFO bt_gap_ready=");
  output.println(boolName(gapReady_));
  output.print("INFO bt_hid_ready=");
  output.println(boolName(hidReady_));
  output.print("INFO bt_app_registered=");
  output.println(boolName(appRegistered_));
  output.print("INFO bt_discoverable=");
  output.println(boolName(discoverable_));
  output.print("INFO bt_connected=");
  output.println(boolName(connected_));
  output.print("INFO bt_auth_complete=");
  output.println(boolName(authComplete_));
  output.print("INFO bt_pairing_complete=");
  output.println(boolName(pairingComplete_));
  output.print("INFO bt_paired=");
  output.println(boolName(paired_));
  output.print("INFO bt_ready_for_reports=");
  output.println(boolName(readyForReports_));
  output.print("INFO bt_init_step=");
  output.println(initStep_);
  output.print("INFO bt_init_error=");
  output.println(initError_);

