RealxSCV/TomotachiLife-AutoDrawing/firmware/esp32/src/classic_bt_controller_transport.cpp
  if (hasPeerAddress_) {
    output.print("INFO bt_last_peer=");
    output.println(formatBluetoothAddress(lastPeerAddress_));
  }
}

const char *ClassicBtControllerTransport::name() const { return CONTROL_TRANSPORT; }

bool ClassicBtControllerTransport::sendCurrentInputReport(bool logFailure) {
  if (!readyForReports_) {
    if (logFailure) {
      Serial.println("WARN bt report skipped reason=not-ready");
    }
    return false;
  }

  updateInputReport();

  const bool shouldSendFullReport = connected_ || paired_;
  const uint8_t *payload = shouldSendFullReport ? report30_ : dummyReport_;
  const size_t payloadLength = shouldSendFullReport ? sizeof(report30_) : sizeof(dummyReport_);

  const esp_err_t err = esp_bt_hid_device_send_report(
      ESP_HIDD_REPORT_TYPE_INTRDATA,
      0x30,
      payloadLength,
      const_cast<uint8_t *>(payload));
  if (err != ESP_OK) {
    readyForReports_ = false;
    if (logFailure) {
      Serial.printf("WARN bt send_report failed err=%s\n", esp_err_to_name(err));
    }
    return false;
  }

  timer_ = static_cast<uint8_t>(timer_ + 1);
  return true;
}

bool ClassicBtControllerTransport::sendSubcommandReply(
    uint8_t reportId, const uint8_t *data, size_t length, const char *label) {
  if (!readyForReports_) {
    Serial.printf("WARN bt reply skipped reason=not-ready label=%s\n", label);
    return false;
  }

  const esp_err_t err = esp_bt_hid_device_send_report(
      ESP_HIDD_REPORT_TYPE_INTRDATA,
      reportId,
      length,
      const_cast<uint8_t *>(data));
  if (err != ESP_OK) {
    readyForReports_ = false;
    Serial.printf("WARN bt reply failed label=%s err=%s\n", label, esp_err_to_name(err));
    return false;
  }

  Serial.printf("INFO bt reply label=%s report=%u len=%u\n", label, reportId, length);
  return true;
}

bool ClassicBtControllerTransport::attemptVirtualCablePlug(
    const uint8_t peerAddress[6], const char *reason) {
  if (!appRegistered_ || !hidReady_ || connected_) {
    return false;
  }

  const esp_err_t err = esp_bt_hid_device_connect(const_cast<uint8_t *>(peerAddress));
  if (err != ESP_OK) {
    Serial.printf(
        "WARN bt virtual-cable reason=%s err=%s peer=%s\n",
        reason,
        esp_err_to_name(err),
        formatBluetoothAddress(peerAddress).c_str());
    return false;
  }

  Serial.printf(
      "INFO bt virtual-cable reason=%s peer=%s\n",
      reason,
      formatBluetoothAddress(peerAddress).c_str());
  return true;
}

void ClassicBtControllerTransport::processIncomingReport(uint8_t reportId, uint16_t len, uint8_t *data) {
  if (len < 12 || data == nullptr) {
    Serial.printf("INFO bt intr ignored report=%u len=%u\n", reportId, len);
    return;
  }

  Serial.printf(
      "INFO bt intr report=%u len=%u subcmd=%u arg0=%u arg1=%u\n",
      reportId,
      len,
      data[9],
      data[10],
      data[11]);

  if (data[9] == 2) {
    sendSubcommandReply(0x21, kReply02, sizeof(kReply02), "reply02");
    return;
  }
  if (data[9] == 8) {
    sendSubcommandReply(0x21, kReply08, sizeof(kReply08), "reply08");
    return;
  }
  if (data[9] == 16 && data[10] == 0 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress0, sizeof(kReplySpiAddress0), "replyspi0");
    return;
  }
  if (data[9] == 16 && data[10] == 80 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress50, sizeof(kReplySpiAddress50), "replyspi50");
    return;
  }
  if (data[9] == 3) {
    sendSubcommandReply(0x21, kReply03, sizeof(kReply03), "reply03");
    return;
  }
  if (data[9] == 4) {
    sendSubcommandReply(0x21, kReply04, sizeof(kReply04), "reply04");
    return;
  }
  if (data[9] == 16 && data[10] == 128 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress80, sizeof(kReplySpiAddress80), "replyspi80");
    return;
  }
  if (data[9] == 16 && data[10] == 152 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress98, sizeof(kReplySpiAddress98), "replyspi98");
    return;
  }
  if (data[9] == 16 && data[10] == 16 && data[11] == 128) {
    sendSubcommandReply(0x21, kReplySpiAddress10, sizeof(kReplySpiAddress10), "replyspi10");
    return;
  }
  if (data[9] == 16 && data[10] == 61 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress3D, sizeof(kReplySpiAddress3D), "replyspi3d");
    return;
  }
  if (data[9] == 16 && data[10] == 32 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress20, sizeof(kReplySpiAddress20), "replyspi20");
    return;
  }
  if (data[9] == 64) {
    sendSubcommandReply(0x21, kReply4001, sizeof(kReply4001), "reply4001");
    return;
  }
  if (data[9] == 72) {
    sendSubcommandReply(0x21, kReply4801, sizeof(kReply4801), "reply4801");
    return;
  }
  if (data[9] == 34) {
    sendSubcommandReply(0x21, kReply3401, sizeof(kReply3401), "reply3401");
    return;
  }
  if (data[9] == 48) {
    paired_ = true;
    pairingComplete_ = true;
    sendSubcommandReply(0x21, kReply3001, sizeof(kReply3001), "reply3001");
    return;
  }
  if (data[9] == 33 && data[10] == 33) {
    paired_ = true;
    pairingComplete_ = true;
    sendSubcommandReply(0x21, kReply3333, sizeof(kReply3333), "reply3333");
    return;
  }
}

void ClassicBtControllerTransport::handleGapEvent(int event, void *rawParam) {
  const auto gapEvent = static_cast<esp_bt_gap_cb_event_t>(event);
  auto *param = reinterpret_cast<esp_bt_gap_cb_param_t *>(rawParam);

  switch (gapEvent) {
    case ESP_BT_GAP_AUTH_CMPL_EVT:
      authComplete_ = param->auth_cmpl.stat == ESP_BT_STATUS_SUCCESS;
      Serial.printf(
          "INFO bt auth status=%d device=\"%s\"\n",
          param->auth_cmpl.stat,
          reinterpret_cast<const char *>(param->auth_cmpl.device_name));
      if (param->auth_cmpl.stat == ESP_BT_STATUS_SUCCESS) {
        std::memcpy(lastPeerAddress_, param->auth_cmpl.bda, sizeof(lastPeerAddress_));
        hasPeerAddress_ = true;
        attemptVirtualCablePlug(lastPeerAddress_, "auth-complete");
      }
      break;
    case ESP_BT_GAP_MODE_CHG_EVT:
      Serial.printf("INFO bt mode-change mode=%u\n", param->mode_chg.mode);
      break;
    case ESP_BT_GAP_ACL_CONN_CMPL_STAT_EVT:
      Serial.printf("INFO bt acl-connect status=%u\n", param->acl_conn_cmpl_stat.stat);
      break;
    case ESP_BT_GAP_ACL_DISCONN_CMPL_STAT_EVT:
      Serial.printf("INFO bt acl-disconnect reason=%u\n", param->acl_disconn_cmpl_stat.reason);
      connected_ = false;
      readyForReports_ = false;
      authComplete_ = false;
      pairingComplete_ = false;
      paired_ = false;
      break;
    default:
      break;
  }
}

